## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.root_integration must be replaced
-/+ resource "aws_api_gateway_integration" "root_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "pzybkj" -> (known after apply)
      ~ id                      = "agi-s50ry4jhg5-pzybkj-GET" -> (known after apply)
      ~ integration_http_method = "GET" -> "POST" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_templates       = {} -> null
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>